# Station data: Japanese Name -> (Latitude, Longitude, "English Name")

STATION_COORDINATES = {
    "池袋駅": (35.729667213287634, 139.7108863250159, "Ikebukuro Station"),
    "新宿駅": (35.68896611518613, 139.70093430572538, "Shinjuku Station"),
    "渋谷駅": (35.658557364723535, 139.70150648847576, "Shibuya Station"),
    "目黒駅": (35.634025106747394, 139.71572512674456, "Meguro Station"),
    "品川駅": (35.628518595471164, 139.7385430621397, "Shinagawa Station"),
    "東京駅": (35.681289115541794, 139.76630350938143, "Tokyo Station"),
    "秋葉原駅": (35.698356143501904, 139.7731806232785, "Akihabara Station"),
    "上野駅": (35.713557251911816, 139.77679385440834, "Ueno Station"),
    "日暮里駅": (35.72807587410608, 139.7706937136957, "Nippori Station"), 
    "王子駅": (35.75234334244323, 139.73828319335195, "Oji Station"),
    "赤羽駅": (35.77777093280701, 139.720860299945, "Akabane Station"),
    "板橋駅": (35.74555902527504, 139.71939422356846, "Itabashi Station"),
    "ときわ台駅": (35.75877262200619, 139.68916262570843, "Tokiwadai Station"), 
    "川口駅": (35.80191946344484, 139.71713860398657, "Kawaguchi Station"),
    "中野駅": (35.70584355421988, 139.66603412883572, "Nakano Station"),
    "駒込駅": (35.73635503315713, 139.74661027866358, "Komagome Station"), 
    "早稲田駅": (35.70581186469178, 139.72110623119204, "Waseda Station (Subway)"), 
    "高田馬場駅": (35.71250643952835, 139.70367464013486, "Takadanobaba Station"),
}